##########################################################################################
### Prerequisites
##########################################################################################
tap 'caskroom/cask'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'josegonzalez/php'
tap 'tomanthony/brews'
brew 'mas'
cask_args appdir: '/Applications'



##########################################################################################
### Critical Applications
##########################################################################################
cask 'xquartz' #prereq
mas '1Password', id: 443987910
cask 'alfred'
cask 'bartender'


##########################################################################################
### Browsers & Plug-ins
##########################################################################################
cask 'firefox'
#cask 'aviator'
cask 'google-chrome'
cask 'torbrowser'
cask 'multifirefox'
cask 'omniweb'
cask 'google-earth-pro'
cask 'google-earth-web-plugin'
cask 'google-hangouts'
#cask 'flash-player'
cask 'vivaldi'


##########################################################################################
### Chat
##########################################################################################
cask 'adium'
brew 'minicom'


##########################################################################################
### Coding: Version Management
##########################################################################################
brew 'git'
brew 'gws'
brew 'gdbm', args: ['with-libgdbm-compat']
brew 'mercurial'
cask 'sourcetree'


##########################################################################################
### Coding: Programming Languages
##########################################################################################
brew 'pyenv-virtualenv'
brew 'pyenv'
brew 'python'
brew 'python3'
brew 'python3'
brew 'rbenv'
brew 'ruby-build'
brew 'lua'
brew 'go'
brew 'erlang'
brew 'elixir'
brew 'node'
brew 's-lang'


##########################################################################################
### Coding: Programming Language Package Managers
##########################################################################################
brew 'homebrew/boneyard/luarocks'


##########################################################################################
### Coding: Build Utilities
##########################################################################################
## java
brew 'ant'
## script
brew 'autoconf'
brew 'automake'
brew 'cmake'
## C related


##########################################################################################
### Coding: Configuration Management
##########################################################################################
brew 'ansible'


##########################################################################################
### Coding: DevOps
##########################################################################################
cask 'vagrant'
brew 'awscli'
brew 'ec2-api-tools'


##########################################################################################
### Coding: IDEs
##########################################################################################
#brew 'maven'


##########################################################################################
### Coding: Libraries & Utilities
##########################################################################################
brew 'cereal'
brew 'mono'
brew 'tailor'


##########################################################################################
### Coding: User Interaction
##########################################################################################
brew 'dialog'


##########################################################################################
### Communication
##########################################################################################
cask 'slack'


##########################################################################################
### Data Science
##########################################################################################
cask 'rstudio'
brew 'pig'


##########################################################################################
### Databases
##########################################################################################
#brew 'berkeley-db'
#brew 'berkeley-db4'
cask 'sequel-pro'
brew 'sqlite'
#brew 'mysql'
#brew 'postgresql'
brew 'redis'
brew 'rrdtool', args: ['with-lua']


##########################################################################################
### Diagramming
##########################################################################################
cask 'yed'
cask 'omnigraffle'


##########################################################################################
### Digital Forensics
##########################################################################################
#brew 'autopsy'
brew 'sleuthkit', args: ['with-afflib', 'with-jni', 'with-libewf']


##########################################################################################
### Document Layout
##########################################################################################
cask 'inkscape'
brew 'pango'


##########################################################################################
### Documentation
##########################################################################################
cask 'clarify'
brew 'cheat'
brew 'doxygen'
brew 'grc'
brew 'shared-mime-info'


##########################################################################################
### Download Utilities
##########################################################################################
brew 'curl'
brew 'lrzsz'
brew 'lynx'
brew 'w3m'
brew 'tin'
brew 'slrn'
brew 'wget'
brew 'youtube-dl'


##########################################################################################
### Disk Utilities
##########################################################################################
cask 'omnidisksweeper'


##########################################################################################
### eBook
##########################################################################################
brew 'ebook-tools'
cask 'calibre'


##########################################################################################
### File Management
##########################################################################################
brew 'detox'
brew 'di'
brew 'par2'
brew 'pigz'
brew 'unrar'
brew 'rename'
brew 'snappy'
brew 'homebrew/dupes/gzip'
brew 'homebrew/dupes/unzip'
brew 'tag'


##########################################################################################
### File System Navigation
##########################################################################################
#cask 'totalfinder'
brew 'apparix'
brew 'fasd'
brew 'midnight-commander'
brew 'ranger'
brew 'tree'


##########################################################################################
### Finder Utilities
##########################################################################################
cask 'geekbench'
cask 'geektool'
cask 'dropzone'
## Screen Saver
brew 'cmatrix'
#cask 'bettertouchtool'
## Quick Look Plugins
cask 'suspicious-package'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'
cask 'betterzipql'


##########################################################################################
### FUSE File Systems
##########################################################################################


##########################################################################################
### Images
##########################################################################################
brew 'jpeg'
brew 'mjpegtools'
cask 'gimp'
#cask 'graphviz'
cask 'lisanet-gimp'
brew 'imagemagick'
brew 'imagesnap'
brew 'gd'
brew 'webp'


##########################################################################################
### Mac Admin Stuff
##########################################################################################
cask 'autodmg'
cask 'createuserpkg'
cask 'pacifist'
cask 'packages'
brew 'pkg-config'


##########################################################################################
### macOS Automation
##########################################################################################
cask 'caffeine'
brew 'osxutils'
brew 'contacts'
brew 'rmtrash'
brew 'sleepwatcher'
brew 'wxmac'


##########################################################################################
### Mail
##########################################################################################
cask 'postbox'
#cask 'mailbox'


##########################################################################################
### Media Players
##########################################################################################
cask 'mplayer-osx-extended'
cask 'vlc'
cask 'mplayerx'


##########################################################################################
### Media Utilities
##########################################################################################
## Media Libraries
brew 'libass'
brew 'libdca'
brew 'libsamplerate'
brew 'libvo-aacenc'
brew 'libvorbis'
brew 'libvpx'
## Codecs
brew 'x264'
brew 'xvid'
brew 'fdk-aac'
brew 'faac'
brew 'faad2'
brew 'flac'
brew 'lame'
brew 'mp4v2'
brew 'opencore-amr'
brew 'opus'
brew 'theora'
## Video
cask 'mkvtools'
#brew 'ffmpeg'
#brew 'ffmpegthumbnailer'
## Audio 
brew 'aften'
#cask 'audacity'
## Metadata
#cask 'filebot'


##########################################################################################
### NAS Related Tools
##########################################################################################
cask 'synology-assistant'


##########################################################################################
### Network Utilities
##########################################################################################
## Generic
brew 'arping'
brew 'c-ares'
brew 'cdpr'
brew 'fping'
brew 'geoip', args: ['with-geoipupdate']
brew 'goaccess', args: ['with-geoip']
brew 'hping'
brew 'ipcalc'
brew 'iperf'
brew 'iperf3'
brew 'mrtg'
brew 'mtr', args: ['with-glib', 'with-gtk+']
brew 'netcat'
brew 'netperf'
brew 'ngrep'
brew 'sip'
brew 'sipcalc'
brew 'socat'
brew 'speedtest_cli'
brew 'tcpflow'
brew 'tcping'
brew 'whatmask'
brew 'wireshark'
brew 'trafshow'
## Ethernet
## Wi-Fi


##########################################################################################
### Process Communication, Management, & Scheduling
##########################################################################################
cask 'lingon-x'
brew 'aurora-cli'
brew 'd-bus'
brew 'dbus'
brew 'fswatch'
brew 'pstree'
brew 'watch'


##########################################################################################
### Productivity
##########################################################################################
cask 'omnifocus'
cask 'omnioutliner'
cask 'omniplan'
cask 'devonthink-pro-office'

##########################################################################################
### Remote Access
##########################################################################################
brew 'autossh'
brew 'csshx'
brew 'shmux'
brew 'homebrew/dupes/openssh'
brew 'stormssh'
brew 'stunnel'


##########################################################################################
### Remote Virtualization
##########################################################################################
cask 'amazon-workspaces'
cask 'citrix-receiver'


##########################################################################################
### Security
##########################################################################################
brew 'openssl'
brew 'apg'
brew 'chkrootkit'
brew 'dirmngr'
brew 'gpg-agent'
brew 'keychain'
brew 'jailkit'
brew 'libgcrypt'
brew 'pdfcrack'
brew 'pwgen'
brew 'sslscan'


##########################################################################################
### Shells & Terminal Emulators
##########################################################################################
brew 'aterm'
brew 'bash'
brew 'fish'
brew 'mobile-shell'
cask 'iterm2'


##########################################################################################
### Shell Tools
##########################################################################################
brew 'bash-completion'
brew 'shtool'
brew 'itermocil'

##########################################################################################
### Sync & Remote File Access
##########################################################################################
#cask 'box-sync'
cask 'spideroakone'
cask 'forklift'
cask 'omnipresence'
cask 'cyberduck'
brew 'duck'
cask 'mountain-duck'


##########################################################################################
### System Utilities
##########################################################################################
#cask 'cocktail'
cask 'insomniax'


##########################################################################################
### Text Editors
##########################################################################################
cask 'macvim'
cask 'nvalt'
brew 'emacs', args: ['with-cocoa', 'with-gnutls']
cask 'bbedit'
brew 'bbcolors'


##########################################################################################
### Text Expansion
##########################################################################################
cask 'textexpander'


##########################################################################################
### Text Processing
##########################################################################################
brew 'bison'
brew 'readline'
brew 'homebrew/boneyard/rbenv-readline'
brew 'libreadline-java'
brew 'with-readline'
brew 'figlet'
brew 'intltool'
brew 'jq'
brew 'psutils'
brew 'texi2html'
brew 'utf8proc'
brew 'xmlstarlet'


##########################################################################################
### tmux & x11 utilities
##########################################################################################
brew 'tmux'
brew 'clipper'
brew 'fontconfig'
brew 'freetype'


##########################################################################################
### Video Games
##########################################################################################
cask 'steam'
cask 'openemu'
cask 'minecraft'


##########################################################################################
### Virtualization, Emulation, & Compatibility Layers
##########################################################################################
cask 'parallels-desktop'
cask 'parallels-virtualization-sdk'
cask 'virtualbox'
cask 'wineskin-winery'
cask 'platypus'


##########################################################################################
### Website Design
##########################################################################################


##########################################################################################
### *nix platform import
##########################################################################################
brew 'debianutils'
brew 'moreutils'
brew 'plan9port'
#GNU
brew 'findutils'
brew 'gawk'
brew 'gcc'
brew 'gnupg'
brew 'gnupg2'
brew 'gnutls'
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/groff'
brew 'homebrew/dupes/less'
brew 'homebrew/dupes/libpcap'
brew 'homebrew/dupes/xar'


##########################################################################################
### Crap to sort through
##########################################################################################
#cask 'java'
#cask 'komodo-edit'
#cask 'objektiv'
#cask 'pdfpenpro'
#brew 'avidemux'
#brew 'cairo'
#brew 'dvtm' # Not sierra compatible
#business report server
#brew 'metabase'
#brew 'nmap' #outdated symlink
#brew 'qt'
#brew 'qt5'
#brew 'qtplay'
#brew 'pyqt'


##########################################################################################
### Template
##########################################################################################


##########################################################################################
### 
##########################################################################################

