##########################################################################################
### Prerequisites
##########################################################################################
tap 'caskroom/cask'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'josegonzalez/php'
tap 'tomanthony/brews'


##########################################################################################
### Browsers & Plug-ins
##########################################################################################
brew 'lynx'
brew 'w3m'

##########################################################################################
### Chat & Communication
##########################################################################################
brew 'minicom'

##########################################################################################
### Coding: Version Management
##########################################################################################
brew 'git'
brew 'git-secret'
brew 'gws'
brew 'gdbm', args: ['with-libgdbm-compat']
brew 'mercurial'

##########################################################################################
### Coding: Python
##########################################################################################
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python'
brew 'python3'

##########################################################################################
### Coding: Lua
##########################################################################################
brew 'lua'
#brew 'homebrew/boneyard/luarocks'

##########################################################################################
### Coding: Ruby
##########################################################################################
brew 'rbenv'
brew 'ruby-build'

##########################################################################################
### Coding: Go
##########################################################################################
brew 'go'
brew 'gimmie'

##########################################################################################
### Coding: Node.js
##########################################################################################
brew 'node'

##########################################################################################
### Coding: Erlang
##########################################################################################
brew 'erlang'
brew 'elixir'

##########################################################################################
### Coding: Build Utilities
##########################################################################################
## java
brew 'ant'
## script
brew 'autoconf'
brew 'automake'
brew 'cmake'
## C related

##########################################################################################
### Coding: Configuration Management
##########################################################################################
brew 'ansible'

##########################################################################################
### Coding: DevOps
##########################################################################################
brew 'awscli'
brew 'ec2-api-tools'


##########################################################################################
### Coding: Libraries & Utilities
##########################################################################################
brew 'cereal'
brew 'mono'
brew 'tailor'

##########################################################################################
### Coding: User Interaction
##########################################################################################
brew 'dialog'


##########################################################################################
### Data Science
##########################################################################################
brew 's-lang'
brew 'pig'



##########################################################################################
### Digital Forensics
##########################################################################################
#brew 'autopsy'
brew 'sleuthkit', args: ['with-afflib', 'with-jni', 'with-libewf']

##########################################################################################
### Document Layout
##########################################################################################
brew 'pango'

##########################################################################################
### Documentation
##########################################################################################
brew 'cheat'
brew 'doxygen'
brew 'grc'
brew 'shared-mime-info'

##########################################################################################
### Download Utilities
##########################################################################################
brew 'curl'
brew 'lrzsz'
brew 'wget'
brew 'youtube-dl'
brew 'tin'
brew 'slrn'

##########################################################################################
### Disk Utilities
##########################################################################################


##########################################################################################
### eBook
##########################################################################################
brew 'ebook-tools'

##########################################################################################
### File Management
##########################################################################################
brew 'detox'
brew 'di'
brew 'par2'
brew 'pigz'
brew 'unrar'
brew 'rename'
brew 'snappy'
brew 'gzip'
brew 'unzip'
brew 'tag'

##########################################################################################
### File System Navigation
##########################################################################################
brew 'apparix'
brew 'fasd'
brew 'midnight-commander'
brew 'ranger'
brew 'tree'

##########################################################################################
### Finder Utilities
##########################################################################################
## Screen Saver
brew 'cmatrix'

##########################################################################################
### FUSE File Systems
##########################################################################################


##########################################################################################
### Images
##########################################################################################
brew 'jpeg'
brew 'mjpegtools'
brew 'imagemagick'
brew 'imagesnap'
brew 'gd'
brew 'webp'

##########################################################################################
### Mac Admin Stuff
##########################################################################################
brew 'pkg-config'

##########################################################################################
### macOS Automation
##########################################################################################
brew 'osxutils'
brew 'contacts'
brew 'rmtrash'
brew 'sleepwatcher'
brew 'wxmac'

##########################################################################################
### Network Utilities
##########################################################################################
## Generic
brew 'arping'
brew 'c-ares'
brew 'cdpr'
brew 'fping'
brew 'geoip', args: ['with-geoipupdate']
brew 'goaccess', args: ['with-geoip']
brew 'hping'
brew 'ipcalc'
brew 'iperf'
brew 'iperf3'
brew 'mrtg'
brew 'mtr', args: ['with-glib', 'with-gtk+']
brew 'netcat'
brew 'netperf'
brew 'ngrep'
brew 'sip'
brew 'sipcalc'
brew 'socat'
brew 'speedtest_cli'
brew 'tcpflow'
brew 'tcping'
brew 'whatmask'
brew 'wireshark'
brew 'trafshow'
## Ethernet
## Wi-Fi

##########################################################################################
### Process Communication, Management, & Scheduling
##########################################################################################
brew 'aurora-cli'
brew 'd-bus'
brew 'dbus'
brew 'fswatch'
brew 'pstree'
brew 'watch'


##########################################################################################
### Remote Access
##########################################################################################
brew 'autossh'
brew 'csshx'
brew 'shmux'
brew 'openssh'
brew 'stormssh'
brew 'stunnel'

##########################################################################################
### Security
##########################################################################################
brew 'openssl'
#brew 'apg'
brew 'chkrootkit'
brew 'dirmngr'
brew 'gpg-agent'
brew 'keychain'
brew 'jailkit'
brew 'libgcrypt'
brew 'pdfcrack'
brew 'pwgen'
brew 'sslscan'

##########################################################################################
### Shells & Terminal Emulators
##########################################################################################
brew 'aterm'
brew 'bash'
brew 'fish'
brew 'mobile-shell'
brew 'zsh'
brew 'antigen'
brew 'z'

##########################################################################################
### Shell Tools
##########################################################################################
brew 'bash-completion'
brew 'shtool'
brew 'itermocil'
brew 'direnv'
brew 'googler'
brew 'nnn'
brew 'slugify'
brew 'spark'
brew 'sshfs'
brew 'sshrc'
brew 'thefuck'
brew 'tldr'


##########################################################################################
### Sync & Remote File Access
##########################################################################################
brew 'duck'

##########################################################################################
### Text Editors
##########################################################################################
brew 'emacs', args: ['with-cocoa', 'with-gnutls']
brew 'bbcolors'

##########################################################################################
### Text Processing
##########################################################################################
brew 'bison'
brew 'readline'
#brew 'homebrew/boneyard/rbenv-readline'
brew 'libreadline-java'
brew 'with-readline'
brew 'figlet'
brew 'intltool'
brew 'jq'
brew 'psutils'
brew 'texi2html'
brew 'utf8proc'
brew 'xmlstarlet'
brew 'pandoc'
brew 'latex2rtf'
brew 'latexml'
brew 'rtf2latex2e'
#brew 'git-latexdiff'
#brew 'latex-mk'

##########################################################################################
### tmux & x11 utilities
##########################################################################################
brew 'tmux'
brew 'clipper'
brew 'wemux'

##########################################################################################
### Website Design
##########################################################################################

##########################################################################################
### *nix platform import
##########################################################################################
brew 'debianutils'
brew 'moreutils'
brew 'plan9port'
#GNU
brew 'findutils'
brew 'gawk'
brew 'gcc'
brew 'gnupg'
brew 'gnupg2'
brew 'gnutls'
brew 'grep'
brew 'groff'
brew 'less'
brew 'libpcap'
#brew 'xar'
brew 'coreutils'

##########################################################################################
### Crap to sort through
##########################################################################################
#cask 'java'
#cask 'komodo-edit'
#cask 'objektiv'
#cask 'pdfpenpro'
#brew 'avidemux'
#brew 'cairo'
#brew 'dvtm' # Not sierra compatible
#business report server
#brew 'metabase'
#brew 'nmap' #outdated symlink
#brew 'qt'
#brew 'qt5'
#brew 'qtplay'
#brew 'pyqt'

##########################################################################################
### Template
##########################################################################################

##########################################################################################
### 
##########################################################################################

