##########################################################################################
### Prerequisites
##########################################################################################
tap 'caskroom/cask'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'josegonzalez/php'
tap 'tomanthony/brews'
brew 'mas'
cask_args appdir: '/Applications'

##########################################################################################
### Critical Applications
##########################################################################################
cask 'xquartz' #prereq
mas '1Password', id: 443987910
cask 'alfred'
cask 'bartender'
mas '1Blocker',id: 1107421413

##########################################################################################
### Browsers & Plug-ins
##########################################################################################
cask 'firefox'
#cask 'aviator'
cask 'google-chrome'
cask 'torbrowser'
cask 'omniweb'
cask 'google-earth-pro'
cask 'google-earth-web-plugin'
cask 'google-hangouts'
cask 'vivaldi'
brew 'lynx'
brew 'w3m'
mas 'Fluid Browser',id: 1077036385

##########################################################################################
### Chat & Communication
##########################################################################################
brew 'minicom'
mas 'Slack',id: 803453959
mas 'Pushbullet',id: 948415170
mas 'Deliveries',id: 924726344

##########################################################################################
### Coding: Version Management
##########################################################################################
brew 'git'
brew 'gws'
brew 'gdbm', args: ['with-libgdbm-compat']
brew 'mercurial'
cask 'sourcetree'

##########################################################################################
### Coding: Python
##########################################################################################
brew 'pyenv'
brew 'pyenv-virtualenv'
#brew 'python'
#brew 'python3'

##########################################################################################
### Coding: Lua
##########################################################################################
brew 'lua'
#brew 'homebrew/boneyard/luarocks'

##########################################################################################
### Coding: Ruby
##########################################################################################
brew 'rbenv'
brew 'ruby-build'

##########################################################################################
### Coding: Go
##########################################################################################
brew 'go'

##########################################################################################
### Coding: Node.js
##########################################################################################
brew 'node'

##########################################################################################
### Coding: Erlang
##########################################################################################
brew 'erlang'
brew 'elixir'

##########################################################################################
### API design & testing
##########################################################################################
mas 'Rested',id: 421879749
mas 'Push Diagnostics',id: 689859502

##########################################################################################
### Coding: Build Utilities
##########################################################################################
## java
brew 'ant'
## script
brew 'autoconf'
brew 'automake'
brew 'cmake'
## C related

##########################################################################################
### Coding: Configuration Management
##########################################################################################
brew 'ansible'
mas 'Apple Configurator 2',id: 1037126344

##########################################################################################
### Coding: DevOps
##########################################################################################
cask 'vagrant'
brew 'awscli'
brew 'ec2-api-tools'

##########################################################################################
### Coding: IDEs
##########################################################################################
#brew 'maven'

##########################################################################################
### Coding: Libraries & Utilities
##########################################################################################
brew 'cereal'
brew 'mono'
brew 'tailor'

##########################################################################################
### Coding: User Interaction
##########################################################################################
brew 'dialog'

##########################################################################################
### Communication
##########################################################################################
#cask 'slack'

##########################################################################################
### Data Science
##########################################################################################
cask 'rstudio'
brew 's-lang'
brew 'pig'

##########################################################################################
### Databases
##########################################################################################
#brew 'berkeley-db'
#brew 'berkeley-db4'
cask 'sequel-pro'
brew 'sqlite'
#brew 'mysql'
#brew 'postgresql'
#brew 'redis'
#brew 'rrdtool', args: ['with-lua']
mas 'Toad',id: 747961939

##########################################################################################
### Diagramming
##########################################################################################
cask 'yed'
cask 'omnigraffle'

##########################################################################################
### Digital Forensics
##########################################################################################
#brew 'autopsy'
brew 'sleuthkit', args: ['with-afflib', 'with-jni', 'with-libewf']

##########################################################################################
### Document Layout
##########################################################################################
cask 'inkscape'
brew 'pango'

##########################################################################################
### Documentation
##########################################################################################
cask 'clarify'
brew 'cheat'
brew 'doxygen'
brew 'grc'
brew 'shared-mime-info'
mas 'Patterns',id: 429449079
mas 'Oyster',id: 655527594
mas 'Pathology',id: 877848776
mas 'JSON Helper',id: 453114608
mas 'JSON Query',id: 953006734

##########################################################################################
### Download Utilities
##########################################################################################
brew 'curl'
brew 'lrzsz'
mas 'SiteSucker',id: 442168834
brew 'wget'
brew 'youtube-dl'
mas 'Transmit',id: 403388562
brew 'tin'
brew 'slrn'
mas 'Reeder',id: 880001334

##########################################################################################
### Disk Utilities
##########################################################################################
cask 'omnidisksweeper'

##########################################################################################
### eBook
##########################################################################################
brew 'ebook-tools'
cask 'calibre'
mas 'iBooks Author',id: 490152466
mas 'Kindle',id: 405399194

##########################################################################################
### File Management
##########################################################################################
brew 'detox'
brew 'di'
brew 'par2'
brew 'pigz'
brew 'unrar'
brew 'rename'
brew 'snappy'
brew 'gzip'
brew 'unzip'
brew 'tag'
mas 'Keka',id: 470158793
mas 'StuffIt Expander 16',id: 919269455
mas 'The Unarchiver',id: 425424353
#mas 'Gemini',id: 463541543

##########################################################################################
### File System Navigation
##########################################################################################
#cask 'totalfinder'
brew 'apparix'
brew 'fasd'
brew 'midnight-commander'
brew 'ranger'
brew 'tree'

##########################################################################################
### Finder Utilities
##########################################################################################
cask 'geekbench'
cask 'geektool'
cask 'dropzone'
mas 'Magnet',id: 441258766
mas 'PopClip',id: 445189367
## Screen Saver
brew 'cmatrix'
#cask 'bettertouchtool'
mas 'BetterSnapTool',id: 417375580
## Quick Look Plugins
cask 'suspicious-package'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'
cask 'betterzipql'
## Services
mas 'WordService',id: 899972312
mas 'CalcService',id: 899970159
mas 'XMenu',id: 419332741
mas 'Local Path',id: 883905375
mas 'Droplr',id: 498672703

##########################################################################################
### FUSE File Systems
##########################################################################################

##########################################################################################
### Health
##########################################################################################
mas 'Day One',id: 1055511498
mas 'Optimism',id: 412369645

##########################################################################################
### Images
##########################################################################################
brew 'jpeg'
brew 'mjpegtools'
cask 'gimp'
#cask 'graphviz'
#cask 'lisanet-gimp'
brew 'imagemagick'
brew 'imagesnap'
brew 'gd'
brew 'webp'
mas 'Pixa',id: 527618971
mas 'Pixelmator',id: 407963104
mas 'Ember',id: 402456742
mas 'PhotoStickies',id: 447313635

##########################################################################################
### Mac Admin Stuff
##########################################################################################
cask 'autodmg'
cask 'createuserpkg'
cask 'pacifist'
cask 'packages'
brew 'pkg-config'

##########################################################################################
### macOS Automation
##########################################################################################
cask 'caffeine'
brew 'osxutils'
brew 'contacts'
brew 'rmtrash'
brew 'sleepwatcher'
brew 'wxmac'
mas 'Fake',id: 402356565

##########################################################################################
### Mail
##########################################################################################
mas 'Airmail 3',id: 918858936
cask 'postbox'
#cask 'mailbox'

##########################################################################################
### Media Players
##########################################################################################
cask 'mplayer-osx-extended'
cask 'vlc'
cask 'mplayerx'

##########################################################################################
### NAS Related Tools
##########################################################################################
#cask 'synology-assistant'

##########################################################################################
### Network Utilities
##########################################################################################
## Generic
brew 'arping'
brew 'c-ares'
brew 'cdpr'
brew 'fping'
brew 'geoip', args: ['with-geoipupdate']
brew 'goaccess', args: ['with-geoip']
brew 'hping'
brew 'ipcalc'
brew 'iperf'
brew 'iperf3'
brew 'mrtg'
brew 'mtr', args: ['with-glib', 'with-gtk+']
brew 'netcat'
brew 'netperf'
brew 'ngrep'
brew 'sip'
brew 'sipcalc'
brew 'socat'
brew 'speedtest_cli'
brew 'tcpflow'
brew 'tcping'
brew 'whatmask'
brew 'wireshark'
brew 'trafshow'
mas 'Geohopper',id: 717779245
## Ethernet
## Wi-Fi
mas 'WiFi Explorer',id: 494803304

##########################################################################################
### Process Communication, Management, & Scheduling
##########################################################################################
cask 'lingon-x'
brew 'aurora-cli'
brew 'd-bus'
brew 'dbus'
brew 'fswatch'
brew 'pstree'
brew 'watch'

##########################################################################################
### Productivity
##########################################################################################
cask 'omnifocus'
cask 'omnioutliner'
cask 'omniplan'
cask 'devonthink-pro-office'
mas 'iThoughtsX',id: 720669838
mas 'Numbers',id: 409203825
mas 'Fantastical 2',id: 975937182
mas 'Pages',id: 409201541
mas 'Keynote',id: 409183694
mas 'MacFamilyTree 7',id: 572280828
mas 'Home Inventory',id: 413564952
mas 'Paprika Recipe Manager',id: 451907568
mas 'Contacts Journal CRM',id: 916377538
mas 'Soulver',id: 413965349
mas 'Next',id: 896146364
mas 'Do',id: 1040329885

##########################################################################################
### Remote Access
##########################################################################################
brew 'autossh'
brew 'csshx'
brew 'shmux'
brew 'openssh'
brew 'stormssh'
brew 'stunnel'
mas 'Microsoft Remote Desktop',id: 715768417

##########################################################################################
### Remote Virtualization
##########################################################################################
cask 'amazon-workspaces'
cask 'citrix-receiver'

##########################################################################################
### Security
##########################################################################################
brew 'openssl'
#brew 'apg'
brew 'chkrootkit'
brew 'dirmngr'
brew 'gpg-agent'
brew 'keychain'
brew 'jailkit'
brew 'libgcrypt'
brew 'pdfcrack'
brew 'pwgen'
brew 'sslscan'
mas 'Audit Explorer',id: 429353921
mas 'Encrypto',id: 935235287
mas 'PGPTools',id: 991305155

##########################################################################################
### Shells & Terminal Emulators
##########################################################################################
brew 'aterm'
brew 'bash'
brew 'fish'
brew 'mobile-shell'
cask 'iterm2'

##########################################################################################
### Shell Tools
##########################################################################################
brew 'bash-completion'
brew 'shtool'
brew 'itermocil'


##########################################################################################
### Sync & Remote File Access
##########################################################################################
#cask 'box-sync'
cask 'spideroakone'
cask 'forklift'
cask 'omnipresence'
cask 'cyberduck'
brew 'duck'
cask 'mountain-duck'
mas 'Evernote',id: 406056744
mas 'Skitch',id: 425955336

##########################################################################################
### System Utilities
##########################################################################################
#cask 'cocktail'
cask 'insomniax'

##########################################################################################
### Text Editors
##########################################################################################
cask 'macvim'
cask 'nvalt'
brew 'emacs', args: ['with-cocoa', 'with-gnutls']
cask 'bbedit'
brew 'bbcolors'
mas 'DeskPM',id: 915839505

##########################################################################################
### Text Expansion
##########################################################################################
cask 'textexpander'

##########################################################################################
### Text Processing
##########################################################################################
brew 'bison'
brew 'readline'
#brew 'homebrew/boneyard/rbenv-readline'
brew 'libreadline-java'
brew 'with-readline'
brew 'figlet'
brew 'intltool'
brew 'jq'
brew 'psutils'
brew 'texi2html'
brew 'utf8proc'
brew 'xmlstarlet'
brew 'pandoc'
cask 'mactex'
brew 'latex2rtf'
brew 'latexml'
brew 'rtf2latex2e'
#brew 'git-latexdiff'
#brew 'latex-mk'

##########################################################################################
### tmux & x11 utilities
##########################################################################################
brew 'tmux'
brew 'clipper'


##########################################################################################
### Virtualization, Emulation, & Compatibility Layers
##########################################################################################
cask 'parallels-desktop'
cask 'parallels-virtualization-sdk'
#mas 'Veertu 2016 Business',id: 1082458124
cask 'virtualbox'
cask 'wineskin-winery'
cask 'platypus'
mas 'App Factory',id: 556464792

##########################################################################################
### Website Design
##########################################################################################

##########################################################################################
### *nix platform import
##########################################################################################
brew 'debianutils'
brew 'moreutils'
brew 'plan9port'
#GNU
brew 'findutils'
brew 'gawk'
brew 'gcc'
brew 'gnupg'
brew 'gnupg2'
brew 'gnutls'
brew 'grep'
brew 'groff'
brew 'less'
brew 'libpcap'
#brew 'xar'

##########################################################################################
### Crap to sort through
##########################################################################################
#cask 'java'
#cask 'komodo-edit'
#cask 'objektiv'
#cask 'pdfpenpro'
#brew 'avidemux'
#brew 'cairo'
#brew 'dvtm' # Not sierra compatible
#business report server
#brew 'metabase'
#brew 'nmap' #outdated symlink
#brew 'qt'
#brew 'qt5'
#brew 'qtplay'
#brew 'pyqt'

##########################################################################################
### Template
##########################################################################################

##########################################################################################
### 
##########################################################################################

